Autodesk.Revit.DB.ExternalFileReference.IsValidExternalFileReference(Autodesk.Revit.DB.ExternalFileReference)
Checks an ExternalFileReference to see if it is
properly created.
Remarks:
The following restrictions exist:
PathType.Server is only valid for ExternalFileReferences of type ExternalFileReferenceType.RevitLink PathType.Content is only valid for ExternalFileReferences of type ExternalFileReferenceType.KeynoteTable,
ExternalFileReferenceType.AssemblyCodeTable or ExternalFileReferenceType.Decal Keynote tables, assembly code tables and Decals  (ExternalFileReferenceType.KeynoteTable,
ExternalFileReferenceType.AssemblyCodeTable and ExternalFileReferenceType.Decal) may only be
LinkedFileStatus.Loaded or LinkedFileStatus.NotFound.
data:
The ExternalFileReference to be checked
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012